
name = input('Введи свое имя >>>')

#name = input(Введи свое имя).upper() 
#функция input принимает значение у 
#пользователя и отдает результат
#функция input всегда сохраняет данные
#в типе строка


print('Привет' , name, '!!!', 'в твоем имени ', len(name), 'букв')

# Домашка  
# Прочитать  и попробовать запустить основные функции для работы
#со строками Почитать про встроенные функции в Python
#Проработать с получением данных от пользователя в разных
#типах данных. Поиграть с преобразованием типов